# Расстановка монеток их координаты
coords_1_lvl_main = [(350, 0), (500, 100), (100, 150), (800, 50), (100, 250),
                     (50, 400), (250, 300), (650, 200), (200, 500), (150, 600),
                     (500, 350), (550, 550), (850, 400), (750, 450), (100, 100)
                     ]
# преобразование координат персонажа и монеток,
# дальше аналогично для 3-х уровней
coords_1_lvl_main_k = [(7, 0), (10, 2), (2, 3), (16, 1), (2, 5), (1, 8),
                       (5, 6), (13, 4), (4, 10), (3, 12), (10, 7), (11, 11),
                       (17, 8), (15, 9), (2, 2)]
coords_1_lvl_main_k_copy = coords_1_lvl_main_k.copy()
coords_1_lvl_copy = coords_1_lvl_main.copy()

coords_2_lvl_main = [(200, 50), (50, 250), (100, 100), (300, 0), (700, 50),
                     (200, 300), (350, 350), (200, 450), (400, 550),
                     (550, 400),
                     (800, 350), (800, 450), (750, 600), (450, 200),
                     (600, 0)]
coords_2_lvl_main_k = [(4, 1), (1, 5), (2, 2), (6, 0), (14, 1), (4, 6),
                       (7, 7), (4, 9), (8, 11), (11, 8), (16, 7), (16, 9),
                       (15, 12), (9, 4), (12, 0)]
coords_2_lvl_main_k_copy = coords_2_lvl_main_k.copy()
coords_2_lvl_copy = coords_2_lvl_main.copy()

coords_3_lvl_main = [(0, 50), (200, 100), (500, 50), (650, 0), (750, 200),
                     (450, 250), (50, 250), (200, 350), (350, 400), (100, 450),
                     (100, 500), (0, 600), (550, 500), (550, 600), (750, 550)]
coords_3_lvl_main_k = [(0, 1), (4, 2), (10, 1), (13, 0), (15, 4), (9, 5),
                       (1, 5), (4, 7), (7, 8), (2, 9), (2, 10), (0, 12),
                       (11, 10), (11, 12), (15, 11)]
coords_3_lvl_main_k_copy = coords_3_lvl_main_k.copy()
coords_3_lvl_copy = coords_3_lvl_main.copy()
